Парк_аттракционов/src/Documents/ПосещениеАттракциона/ПосещениеАттракциона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПосещениеАттракциона</name>
  <registerRecords>AccumulationRegister.АктивныеПосещения</registerRecords>
  <attributes>
    <name>Аттракцион</name>
    <type>
      <types>CatalogRef.Аттракционы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </attributes>
</mdclass:Document>

Парк_аттракционов/src/AccumulationRegisters/АктивныеПосещения/АктивныеПосещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АктивныеПосещения</name>
  <resources>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аттракцион</name>
    <type>
      <types>CatalogRef.Аттракционы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Парк_аттракционов/src/Documents/ПосещениеАттракциона/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр АктивныеПосещения
	Движения.АктивныеПосещения.Записывать = Истина;
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Основание = Основание;
	Движение.Аттракцион = Аттракцион;
	Движение.КоличествоПосещений = 1;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивныеПосещенияОстатки.Основание КАК Основание
		|ИЗ
		|	РегистрНакопления.АктивныеПосещения.Остатки(, Основание = &Основание) КАК АктивныеПосещенияОстатки
		|ГДЕ
		|	АктивныеПосещенияОстатки.КоличествоПосещенийОстаток < 0";
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "По одному билету можно пройти только один раз";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Основание";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
